#### DGNFileFormat Enumeration

---

|  |
| --- |
| See Also |

An enumerated type listing available Microstation versions into which a file may be exported.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2013
  **Since:**  2013

# Syntax

| C# |
| --- |
| ``` public enum DGNFileFormat ``` |

| Visual Basic |
| --- |
| ``` Public Enumeration DGNFileFormat ``` |

| Visual C++ |
| --- |
| ``` public enum class DGNFileFormat ``` |

# Members

| Member name | Description |
| --- | --- |
| DGNVersion7 | Micorstation V7 file format. |
| Default | The Autodesk Revit application's default file format. |
| DGNVersion8 | Micorstation V8 file format. |

# See Also

Autodesk.Revit.DB Namespace